ApacheBenchmark_testing.txt
Описание полей:
Time taken for tests - общее время тестирования.

Complete requests - количество выполненных запросов.

Failed requests - количество неудачных запросов, 0 - сервер выдержал заданную нагрузку

Requests per second - количество запросов в секунду.

Time per request - втечении этого времени выполнились 10 параллельных запросов

Time per request - среднее время выполнения одного запроса

Percentage of the requests served within a certain time (ms) - доля запросов на единицу времени. 

-----------------------------------------------------------------------------------------------------------------------------------

10 паралелльных запросов, общее число запросов -10 

lyubaxapro@lyubaxapro-laptop:/etc/nginx/sites-available$ ab -c 10 -n 10 http://127.0.0.1./api/v1/info/address/
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1. (be patient).....done


Server Software:        nginx/1.18.0
Server Hostname:        127.0.0.1.
Server Port:            80

Document Path:          /api/v1/info/address/
Document Length:        1803 bytes

Concurrency Level:      10
Time taken for tests:   6.980 seconds
Complete requests:      10
Failed requests:        0
Total transferred:      21060 bytes
HTML transferred:       18030 bytes
Requests per second:    1.43 [#/sec] (mean)
Time per request:       6979.864 [ms] (mean)
Time per request:       697.986 [ms] (mean, across all concurrent requests)
Transfer rate:          2.95 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.3      1       1
Processing:   382 2368 2133.3   2119    6246
Waiting:      382 2367 2134.3   2119    6246
Total:        383 2369 2133.3   2119    6247

Percentage of the requests served within a certain time (ms)
  50%   2119
  66%   2309
  75%   2414
  80%   6129
  90%   6247
  95%   6247
  98%   6247
  99%   6247
 100%   6247 (longest request)

 50% запросов выполнились за 2,1 сек, самый долгий запрос выполнялся 6,2 сек.


--------------------------------------------------------------------------------------------------------------------------------
lyubaxapro@lyubaxapro-laptop:/etc/nginx/sites-available$ ab -c 100 -n 100 http://127.0.0.1./api/v1/info/address/
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1. (be patient).....done


Server Software:        nginx/1.18.0
Server Hostname:        127.0.0.1.
Server Port:            80

Document Path:          /api/v1/info/address/
Document Length:        1803 bytes

Concurrency Level:      100
Time taken for tests:   7.890 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      210600 bytes
HTML transferred:       180300 bytes
Requests per second:    12.67 [#/sec] (mean)
Time per request:       7889.718 [ms] (mean)
Time per request:       78.897 [ms] (mean, across all concurrent requests)
Transfer rate:          26.07 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    6   1.3      6       8
Processing:    25 1576 2906.2    264    7835
Waiting:       25 1576 2906.2    264    7835
Total:         33 1582 2905.6    270    7839

Percentage of the requests served within a certain time (ms)
  50%    270
  66%    343
  75%    390
  80%    418
  90%   7743
  95%   7796
  98%   7828
  99%   7839
 100%   7839 (longest request)


 -----------------------------------------------------------------------------------------------------------------------------
 lyubaxapro@lyubaxapro-laptop:/etc/nginx/sites-available$ ab -c 100 -n 1000 http://127.0.0.1./api/v1/info/address/
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1. (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        nginx/1.18.0
Server Hostname:        127.0.0.1.
Server Port:            80

Document Path:          /api/v1/info/address/
Document Length:        1803 bytes

Concurrency Level:      100
Time taken for tests:   5.754 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      2106000 bytes
HTML transferred:       1803000 bytes
Requests per second:    173.80 [#/sec] (mean)
Time per request:       575.377 [ms] (mean)
Time per request:       5.754 [ms] (mean, across all concurrent requests)
Transfer rate:          357.44 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.7      0       3
Processing:    10  523 492.9    282    1202
Waiting:       10  523 492.9    282    1202
Total:         10  524 492.7    282    1202

Percentage of the requests served within a certain time (ms)
  50%    282
  66%   1004
  75%   1109
  80%   1123
  90%   1138
  95%   1175
  98%   1188
  99%   1191
 100%   1202 (longest request)


-----------------------------------------------------------------------------------------------------------------------------

lyubaxapro@lyubaxapro-laptop:/etc/nginx/sites-available$ ab -c 300 -n 10000 http://127.0.0.1./api/v1/info/address/
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1. (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        nginx/1.18.0
Server Hostname:        127.0.0.1.
Server Port:            80

Document Path:          /api/v1/info/address/
Document Length:        1803 bytes

Concurrency Level:      300
Time taken for tests:   94.232 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      21060000 bytes
HTML transferred:       18030000 bytes
Requests per second:    106.12 [#/sec] (mean)
Time per request:       2826.961 [ms] (mean)
Time per request:       9.423 [ms] (mean, across all concurrent requests)
Transfer rate:          218.25 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.0      0      10
Processing:    10 2733 2285.1   3511    7135
Waiting:       10 2733 2285.1   3510    7135
Total:         10 2733 2285.3   3511    7140

Percentage of the requests served within a certain time (ms)
  50%   3511
  66%   5012
  75%   5014
  80%   5016
  90%   5022
  95%   5030
  98%   5531
  99%   6084
 100%   7140 (longest request)

 --------------------------------------------------------------------------------------------------------
lyubaxapro@lyubaxapro-laptop:/etc/nginx/sites-available$ ab -c 300 -n 10000 http://127.0.0.1./api/v1/info/address/
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1. (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        nginx/1.18.0
Server Hostname:        127.0.0.1.
Server Port:            80

Document Path:          /api/v1/info/address/
Document Length:        1803 bytes

Concurrency Level:      300
Time taken for tests:   126.006 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      21060000 bytes
HTML transferred:       18030000 bytes
Requests per second:    79.36 [#/sec] (mean)
Time per request:       3780.189 [ms] (mean)
Time per request:       12.601 [ms] (mean, across all concurrent requests)
Transfer rate:          163.22 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.1      0       9
Processing:    10 3694 2145.2   5027    8621
Waiting:       10 3694 2145.2   5026    8621
Total:         10 3694 2145.4   5027    8626

Percentage of the requests served within a certain time (ms)
  50%   5027
  66%   5038
  75%   5045
  80%   5049
  90%   5065
  95%   5114
  98%   6263
  99%   7416
 100%   8626 (longest request)